using System;

namespace Масси_Двумерный__многомерный_
{
    internal class Program
    {
        static void Main(string[] args)
        {
            //Многомерный массив бывает: прямоугольный, зубчатый, ступенчатый.
            //Любой массив, количество измерений бывает большего 1 - это многомерный
            //Двумерный прямоугольный массив. Одномерный массив - это некая коллекция данных
            //Любая переменная - ярлык, через который мы можем получить доступ к памяти: 
            //либо поместить туда что-то, либо извлечь.
            //Массив - такой же ярлык, но через него мы получим доступ к нескольким переменным.
            //Но вместо того, чтобы именовать каждую переменную отдельно, мы называем сам массив,
            //и обращаемся к каждому элементу по какому-то индексу.
            //Дом и квартиры в доме. Массив - коллекция элементов, у каждого элемента свой индекс.
            //Зная имя массива, указав индекс, какой хотим - можем получить или добавить данные.
            //Когда мы взаимодействует с элементами одномерного массива, то мы работаем с ним
            //только в одном измерении, т.е. по оси x.
            //А если работаем с двумерным массивом, то все становится похоже на игру "морской бой".
            //Есть ряды и колонки. У нас есть 2 степени свободы, 2 измерения: ось x и ось y.
            //Получаем доступ по определенным координатам к каким-то данным.
            //Index = 1 ; 2. 1- координат по оси y, 2 - координаты по оси x.
            //Прямоугольный массив - в каждом ряду и строке будет одинаковое количество элементов.
            //
        }
    }
}
